df16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>dreamforce 2016</title>
<!-- 2016-09-30 金 18:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="natsuki.takeda" />
<link rel="stylesheet" type="text/css" href="./resource/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./resource/readtheorg/css/readtheorg.css"/>


</head>
<body>
<div id="content">
<h1 class="title">dreamforce 2016</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Smart Cities Finding Actionable Insights from Big Data</a>
<ul>
<li><a href="#sec-1-1">1.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Salesforce &amp; Partners, Blazing Trails to Customer Transformation</a>
<ul>
<li><a href="#sec-2-1">2.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-3">3. What's Coming from Salesforce and Microsoft</a>
<ul>
<li><a href="#sec-3-1">3.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Building Heroku + Force.com Architectures to Extend Your Salesforce Deployment</a>
<ul>
<li><a href="#sec-4-1">4.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-5">5. "Be a Customer Trailblazer" with Marc Benioff &amp; Special Guests</a>
<ul>
<li><a href="#sec-5-1">5.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Deep Dive into the New Salesforce Development Experience (DX) Architecture</a>
<ul>
<li><a href="#sec-6-1">6.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Building Force.com Apps from Source</a>
<ul>
<li><a href="#sec-7-1">7.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-8">8. How Salesforce Builds Salesforce using Heroku</a>
<ul>
<li><a href="#sec-8-1">8.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Salesforce for Marketing Keynote: The Smartest CRM for 1-to-1 Customer Journeys</a>
<ul>
<li><a href="#sec-9-1">9.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Salesforce for Developers Keynote</a>
<ul>
<li><a href="#sec-10-1">10.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Salesforce Einstein Keynote: AI for Everyone</a>
<ul>
<li><a href="#sec-11-1">11.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Continuous Delivery from Dev to Production with Heroku Flow</a>
<ul>
<li><a href="#sec-12-1">12.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-13">13. Salesforce for Admins Keynote</a>
<ul>
<li><a href="#sec-13-1">13.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-14">14. Build Sophisticated App Configurations with Custom Metadata</a>
<ul>
<li><a href="#sec-14-1">14.1. Overview</a></li>
</ul>
</li>
<li><a href="#sec-15">15. Template Title</a>
<ul>
<li><a href="#sec-15-1">15.1. Overview</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Smart Cities Finding Actionable Insights from Big Data</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
</div><ol class="org-ol"><li><a id="sec-1-1-1" name="sec-1-1-1"></a>Description<br  /><div class="outline-text-4" id="text-1-1-1">
<p>
Join us to learn how Analytics in the cloud are transforming Urban Services, as delivered by both public and private sectors.
</p>
</div>
</li>
<li><a id="sec-1-1-2" name="sec-1-1-2"></a>Speaker<br  /><div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Ammar Alammar: Practice Senior Director Salesforce
</li>
<li>Dipen Dhruv: Services Sales Director - APAC Salesforce
</li>
<li>gordon feller: Cisco Systems HQ - consultant; Meeting of the Minds - founder cisco
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Salesforce &amp; Partners, Blazing Trails to Customer Transformation</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
</div><ol class="org-ol"><li><a id="sec-2-1-1" name="sec-2-1-1"></a>Description<br  /><div class="outline-text-4" id="text-2-1-1">
<p>
The Salesforce partner ecosystem is a powerful force. As the world's largest, and most connected Cloud ecosystem, we come together to drive customer transformation and innovation in whole new ways. Join Tyler Prince, EVP, WW Alliances &amp; GTM Innovation and gain insights into partner success, market opportunities and other initiatives that empower Salesforce and partners to continue blazing trails of customer transformation and success.
</p>
</div>
</li>
<li><a id="sec-2-1-2" name="sec-2-1-2"></a>Spekaer<br  /><div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Keith Block: ice Chairman, President &amp; COO Salesforce
</li>
<li>Pam Miller: IDC
</li>
<li>Tyler Prince: Executive Vice President, Channels and GTM Innovation Salesforce
</li>
<li>Adam Seligman: EVP, App Cloud Salesforce
</li>
<li>Todd Surdey: Senior Vice President Salesforce
</li>
<li>Neeracha Taychakhoonavudh: SVP, Partner Programs &amp; Enablement Salesforc
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> What's Coming from Salesforce and Microsoft</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Overview</h3>
<div class="outline-text-3" id="text-3-1">
</div><ol class="org-ol"><li><a id="sec-3-1-1" name="sec-3-1-1"></a>Description<br  /><div class="outline-text-4" id="text-3-1-1">
<p>
The Salesforce and Microsoft strategic partnership is ushering in a new era of efficiency and productivity, enabling the creation of over ten new and powerful integrations that seamlessly combine the vast resources of Salesforce, the top CRM, and Microsoft Office. Join us to learn how BMC Software is leveraging our integrations to work and collaborate with more efficiency and intelligence.
</p>
</div>
</li>
<li><a id="sec-3-1-2" name="sec-3-1-2"></a>Spekaer<br  /><div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Philippe Marinier: Salesforce
</li>
<li>Daniel Zubkoff: Sr. Director BMC Software
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Building Heroku + Force.com Architectures to Extend Your Salesforce Deployment</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Overview</h3>
<div class="outline-text-3" id="text-4-1">
</div><ol class="org-ol"><li><a id="sec-4-1-1" name="sec-4-1-1"></a>Description<br  /><div class="outline-text-4" id="text-4-1-1">
<p>
Our Trailblazers build amazing things with the App Cloud. With over 15 million custom apps developed on App Cloud, developers occasionally run into a requirements that seem impossible to solve with Force.com alone. Very often, Heroku is the solution. In this session we will describe real world architecture patterns and show how App Cloud (Heroku + Force.com together) provide robust and scalable solutions for the patterns.
</p>
</div>
</li>
<li><a id="sec-4-1-2" name="sec-4-1-2"></a>Speaker<br  /><div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>Dan Mehlman: Salesforce
</li>
<li>Gopal Patel: CTO GetFeedback
</li>
<li>Peter Shankar: Chief Technology Officer Equity Multiple
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> "Be a Customer Trailblazer" with Marc Benioff &amp; Special Guests</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Overview</h3>
<div class="outline-text-3" id="text-5-1">
</div><ol class="org-ol"><li><a id="sec-5-1-1" name="sec-5-1-1"></a>Description<br  /><div class="outline-text-4" id="text-5-1-1">
<p>
Join Marc Benioff and industry giants to see the future of customer engagement. Marc will highlight how innovative companies are using the cloud, mobility, IoT and artificial intelligence to achieve new levels of success with connecting with their customers. Salesforce will showcase new products and technology like Einstein that will dramatically change how employees across sales, service, marketing &amp; IT perform their jobs and engage with customers. Seating in the Main Keynote is limited. Attendees will be seated first-come, first-served. The keynote will be broadcast at locations throughout the Dreamforce Campus.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Deep Dive into the New Salesforce Development Experience (DX) Architecture</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Overview</h3>
<div class="outline-text-3" id="text-6-1">
</div><ol class="org-ol"><li><a id="sec-6-1-1" name="sec-6-1-1"></a>Description<br  /><div class="outline-text-4" id="text-6-1-1">
<p>
The new Developer Experience for Force.com developers required a new way to think about development on the Platform. Join us as we discuss the architectural changes within the Force.com Platform to support the new Developer Experience. Find out what is being changed within the Platform and what is being developed on the client. This is a technical session covering a new way to think about development orgs, source change tracking, team development, test running and other exciting upcoming features.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Building Force.com Apps from Source</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Overview</h3>
<div class="outline-text-3" id="text-7-1">
</div><ol class="org-ol"><li><a id="sec-7-1-1" name="sec-7-1-1"></a>Description<br  /><div class="outline-text-4" id="text-7-1-1">
<p>
Learn about the new features being built out in within the AppCloud Developer Experience. In this session, we will discuss the App Cloud CLI Plugin, Workspace Orgs for development and testing, as well as our Source Synchronization commands to help you better interact with an org and more easily integrate with source control systems.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> How Salesforce Builds Salesforce using Heroku</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Overview</h3>
<div class="outline-text-3" id="text-8-1">
</div><ol class="org-ol"><li><a id="sec-8-1-1" name="sec-8-1-1"></a>Description<br  /><div class="outline-text-4" id="text-8-1-1">
<p>
Attend this session and learn how Salesforce development teams build amazing apps using Heroku for greater agility while maintaining the highest level of trust. We use Heroku for internal apps like our Concierge IT portal, external apps like Trailhead, and secure data synchronization between internal Salesforce orgs. You’ll see how we use Heroku to build apps that provide a unified user experience and presentation layer across multiple different Salesforce orgs.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Salesforce for Marketing Keynote: The Smartest CRM for 1-to-1 Customer Journeys</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Overview</h3>
<div class="outline-text-3" id="text-9-1">
</div><ol class="org-ol"><li><a id="sec-9-1-1" name="sec-9-1-1"></a>Description<br  /><div class="outline-text-4" id="text-9-1-1">
<p>
Marketing is the sum of all interactions with your brand. In a world where customer experience is king, relevant and contextual interactions are the keys to the kingdom. Join Bryan Wade, CPO &amp; SVP of Marketing Cloud, and special guests to discover an evolution in marketing that puts the customer at the center of every experience with your brand &#x2013; from awareness and acquisition, to retention. Hear how the world's most innovative companies, including Change.org, MasterCard, and Dunkin' Brands, are getting smarter and more predictive about their customers, creating seamless 1-to-1 customer journeys.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Salesforce for Developers Keynote</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Overview</h3>
<div class="outline-text-3" id="text-10-1">
</div><ol class="org-ol"><li><a id="sec-10-1-1" name="sec-10-1-1"></a>Description<br  /><div class="outline-text-4" id="text-10-1-1">
<p>
Apps have never been more critical in our lives and our work, and everything and everyone is connected. This app revolution has given rise to a global renaissance for developers. At the same time, our digital experiences are often disconnected and new apps frequently lag expectations. Join Srini Tallapragada, President, Technology at Salesforce, in this year's Developer Keynote, to learn how to build apps faster, smarter and for the future, today.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Salesforce Einstein Keynote: AI for Everyone</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Overview</h3>
<div class="outline-text-3" id="text-11-1">
</div><ol class="org-ol"><li><a id="sec-11-1-1" name="sec-11-1-1"></a>Description<br  /><div class="outline-text-4" id="text-11-1-1">
<p>
AI is the next great technology disruption transforming how we live and work, and Salesforce Einstein is the first comprehensive AI platform for CRM. Join John Ball, GM of Salesforce Einstein, along with some of Salesforce's most innovative customers, to see how they're getting smarter and more predictive about their customers.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Continuous Delivery from Dev to Production with Heroku Flow</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> Overview</h3>
<div class="outline-text-3" id="text-12-1">
</div><ol class="org-ol"><li><a id="sec-12-1-1" name="sec-12-1-1"></a>Description<br  /><div class="outline-text-4" id="text-12-1-1">
<p>
Delivering software in small batches in a continuous manner drastically reduces risk and is one of the core tenets of Agile methodology. Continuous Delivery (CD) takes a disciplined approach to building software, where it's releasable to production at any time. Join us to see how Heroku Flow embeds CD right into the platform, making it easy for teams to iterate rapidly on apps and features customers care about.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Salesforce for Admins Keynote</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Overview</h3>
<div class="outline-text-3" id="text-13-1">
</div><ol class="org-ol"><li><a id="sec-13-1-1" name="sec-13-1-1"></a>Description<br  /><div class="outline-text-4" id="text-13-1-1">
<p>
Every day is an adventure when you're a Salesforce Administrator. You spend your days in the cloud and on the ground in a quest to become more efficient and more effective. You're passionate about productivity and using innovative technology to create positive and lasting impact for your customers, your company and the community. Join Mike Rosenbaum, EVP CRM Applications, Kris Lande, Sr. Director Admin Marketing and Mike Gerholdt, Sr. Manager Admin Evangelism on an adventure with fellow Trailblazers as we discover new ways to use technology to go faster, get smarter and go further.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Build Sophisticated App Configurations with Custom Metadata</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> Overview</h3>
<div class="outline-text-3" id="text-14-1">
</div><ol class="org-ol"><li><a id="sec-14-1-1" name="sec-14-1-1"></a>Description<br  /><div class="outline-text-4" id="text-14-1-1">
<p>
At Dreamforce last year we launched custom metadata types. This year we add a heavily requested, powerful new capability: metadata relationships. You can now build complex, hierarchical metadata structures by relating your custom metadata to other custom metadata and even to standard and custom objects and fields! If you are still using custom settings or custom objects for app configurations, attend this session to learn how custom metadata types can save your time and sanity managing app configurations and eliminate the need for sophisticated custom tooling or manual configuration and deployment processes.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Template Title</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> Overview</h3>
<div class="outline-text-3" id="text-15-1">
</div><ol class="org-ol"><li><a id="sec-15-1-1" name="sec-15-1-1"></a>Description<br  /></li>
<li><a id="sec-15-1-2" name="sec-15-1-2"></a>Spekaer<br  /><div class="outline-text-4" id="text-15-1-2">
<ul class="org-ul">
<li>hoge
</li>
<li>fuga
</li>
</ul>
</div>
</li></ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: natsuki.takeda</p>
<p class="date">Created: 2016-09-30 金 18:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
